//
//  PageViews.swift
//  CluesToTheCrime
//
//  Created by Denislav Dimitrov on 18.06.24.
//

import SwiftUI
import CoreHaptics

struct CoverView: View {
    var body: some View {
        ZStack {
            Image("leather-texture")
                .resizable(capInsets: EdgeInsets(), resizingMode: .stretch)
                .edgesIgnoringSafeArea(.top)
            Text("Damon Myers")
                .foregroundStyle(.white)
                .font(.system(size: 38, design: .serif))
                .bold()
                .padding(.bottom, 180)
        }
    }
}

struct PageOneView: View {
    var body: some View {
        ZStack {
            DiaryPageBackground()
            
            VStack {
                TextSection(date: "March 15, 2021", text: "I had a productive day at work today. Finished a major project that I’ve been working on for weeks. It feels great to see it finally completed. The team celebrated with a small party, and everyone was in high spirits.In the evening, I treated myself to a nice dinner at a new restaurant I've been wanting to try. The food was exquisite, and the ambiance was perfect for unwinding after a long day. I ended the night by watching my favorite show and reflecting on the achievements of the day.")
                TextSection(date: "April 2, 2021", text: "Went to the farmer's market this morning and bought some fresh fruits and vegetables. I spent the afternoon cooking a new recipe, and it turned out delicious!")
            }
            .padding(.horizontal, 30)
        }
    }
}


struct PageTwoView: View {
    var body: some View {
        ZStack {
            DiaryPageBackground()
            
            VStack(alignment: .leading) {
                TextSection(date: "May 10, 2021", text: "Met up with some friends I haven’t seen in a while. We had lunch at a new café downtown. It was so good to catch up and hear about what everyone’s been up to. We laughed a lot and made plans to meet again soon.")
                TextSection(date: "May 12, 2021", text: "Today, we wandered around the city, exploring new shops and taking in the sights. We even stumbled upon a street performance and watched for a while. It was a day filled with joy and connection, and I felt grateful for the friendships that have stood the test of time.")
            }
            .padding(.horizontal, 30)
        }
    }
}


struct PageThreeView: View {
    var body: some View {
        ZStack {
            DiaryPageBackground()
            
            VStack {
                TextSection(date: "June 8, 2021", text: "Spent the day at the beach. The weather was perfect, not too hot and with a gentle breeze. I swam in the ocean, built sandcastles with the kids, and had a picnic by the shore. It was a day well spent.")
                TextSection(date: "July 19, 2021", text: "Had a quiet day at home today. I did some gardening in the morning, planting new flowers and tidying up the yard. It was so satisfying to see the garden looking vibrant and healthy. I then spent the afternoon painting. It's so relaxing to just lose myself in my hobbies.")
            }
            .padding(.horizontal, 30)
        }
    }
}


struct PageFourView: View {
    var body: some View {
        ZStack {
            DiaryPageBackground()
            
            VStack {
                TextSection(date: "August 12, 2021", text: "Went hiking in the mountains today. The trail was challenging, but the views from the top were worth it. I felt a great sense of accomplishment reaching the peak and enjoyed the peaceful surroundings. The air was crisp and fresh, and the scenery was breathtaking.")
                TextSection(date: "September 30, 2021", text: "Visited the local art museum today. They have a new exhibit that I've been wanting to see. The artwork was stunning, and I felt inspired to create something of my own. I spent hours wandering through the galleries, absorbing the creativity and talent on display.")
            }
            .padding(.horizontal, 30)
        }
    }
}


// The page which contains the note
struct PageFiveNoteView: View {
    @Binding var showFallingNote: Bool
    @Binding var noteVisible: Bool
    @Binding var stage: Int
    @Binding var hideDiary: Bool
    @StateObject private var hapticFeedbackManager = HapticFeedbackManager()

    var body: some View {
        ZStack {
            if !hideDiary {
                DiaryPageBackground()
                
                VStack {
                    TextSection(date: "October 2, 2021", text: "W͘ę̸̶̛̞͇͉̭̣̞̠̪̠͚̖̯̫͎̬͖ͦ̿̈͐͌̊͊̀ͨ̉̾̊ͣͪ́ͦͧ̌̋̍ͫ͜n̴͚̙̂ͦ̌̏̓̈́͂ͯ͘_̢̱̞̮͕̱̼͒̍̑ͬ̄̎̏̃ͬ̑̾̃͘ţ̴̡͓̘̼̯̰̳̺͖̰̟̟̈̇̿͛̀͆ͦ͑ͨ͛̔̈́̈͢ h̡̧̨̛̳̺̥̻͍͖͈͇̠̖ͤ̇̓ͭ͛̈̈͋ͥͭ͟͠͞͞i̦_͚͊͗ͫ͝͡k̶̨̝̹̂ͤ_̴̵̨̬͉̲̹̬̱̤̼̗̂͒̾̀ͬ͋͒ͤ͆_̻͔ͬ̒̓ͤ̿i̶̸̵̶̛̞͖̣͕̹̯̹̹̘̭̳̯̾̅̈̓ͮ̒ͅͅn̴̛͔̟̳̲̦͖͇̺͕̠̰̦͈̙̞͂͐͗̽̎̄́̀̈͑̍̂̄̇ͬ͒ͥ̎̿́͘ͅͅg̴̨̛̪̼̻͚ͣ̔͗͋̓ͨ͗̈́͋ͤͣ̚͝_̴̷̶̨̛͍̠̯̗̬̒̅̽̍̉ͯ̇̕͟͡͡ͅ i̵̭͔͙̱͇̜̮͍̝͎ͣ́͒̿͒ͨͧ̔ͦ̔̎ͩ̊ͯ̅̏͆̐͊͘͘̕̚͢͢͜͠͞͝n͚̝̗͛̍ t̛̮̳̫̹͚͑͋̎̔ͭ̊̔̕ḩ̶̷͈͚̯͈̘̮̭͚̖͈͙̖̗͉͚͔̰̓̂͌ͨ͋̉̎͛̈́̀͂̑̚͢͞ȩ̵̨̟͉̪̦͌̓ͨ̆̓̋̓̔̊̐̎͋ͬ̏͂̏͐̽̕͜͝͝ͅ m̸̧͕̺̣͓̪̞̲̞͈̱̼̫̟͗͒ͮ̈́̈́̈ͧ͒͌̅͌́̉̾̂ͤ͒̽̆͢͢o̸̢͉̣̦̠͎̣͍̞̻̖̹̲̜ͦ̓́͂̅́ͣ͋́̀̉̈́͋̅ͣ͊̆̔ͯ_̜̻͂ͅū̹̤͊̕n̴͖̜͐ͪͪ͟͝ţ̴̷̶̵̛̛͚̞̫̖̰̰̗̠͇̦̠̉̌̃̐ͦͥ̉̾ͮ̈́͟͠͠͞ạ̷̵̢̡̝̰͕̟̥̙̣͆̓̋̋́͂̽͢͡͝͡į̶̶̛̼͓̰̘͎͈ͮͫ͑̄̆ͥ̋̋̿́̒̊ͤͤ́̑͊ͤ͠͡ṋ̴̠̫̦͍̮̉̋̆ͣ͒͒ͣͬ͋͝͞_̸̘̜̭̋̍̽̍ͣ̆ͅs̶̨̧̨͔̭̹̥̼̯̤͈̲̪̫̝̦̤̖̫̪̓̐͛͛͌̏͑̃̅̿́̚ t̶̶̩̫̥̙ͨ̀̏ͪ̊̃͛̒͂̇͟͞ͅͅ_̢̻̼͙̙̳̺̑͂̇̏͒́͆̎ͬͨ̔͡ỏ̱͉̥ͫͧ̐ͤ̃͟͠d͎̯̳͉̣̗̯̯̥̹̫̱ͩ̿̓̾́ͦ̌̈́̽̑ͩ͜͢a̵̢̗̜͇̖̖͕͇̭̯̮͚̫͓̜̙͙͛̃͗̂̓ͭ̌ͦ͐ͣ̇̄̈́͐̕͜͠ͅy̴̵̧̧͔͚̥̦͔̭̻̽̀͜_̵̻̪͓̗̫ͦͣ̽ͧ̑̿͌͊ͅ.̶̹̭͗ͬ T̛̜̫̤̻̙̗̲̭̩̮̒́̑́ͮ̊̏͊̈̄͛͞͠ͅ_̼̦̜͋̍̀̅́͝ͅh͙̲̽e̛͈̯͉̺͔̟̘̳̪̖̜ͣͧ̎͊ͬͫ͗̉̒̍͐̀͑̓̚͟͢ t̩̰̺̩̩̦̘̞͚̃͋̉͐̐̚r̶̷̡̨̰͇͓̣̺̰̜̣͎̼ͮ̊̈̎̈̒ͯͨ͌̓ͨ̃̅̿̂ͨ̏ͅͅa̶̜͖̭͚͙͍̖͉̪̫͓̯̰ͦ̂̀ͫ̔̋ͫͬ͐ͤͫͪ͆̀̐̉̀̇͐̂̓̐̐ͭ̌̃̈̕͜͢͡ͅį̷̷̧̙͉̹̩͙̗͆ͬͩ̍̆̀ͧ̓̽̒̚̚͢_̵̧͓̹̯̜͎̥̾̒ͦͤ̃͑͛̾̿͢_̪͎l̵̶̷̢̧̢̹̞̖͖̬̱̥̙̱̫̰͖͙̭͚̲̦̖͈̥͒̾͆ͩͦ́̚̕͝͝ w̵̷̡̧̫̞̺̲̳̠̘͔̯̣̩͓̘̞̣͎ͤ̋̊ͣ́̓̐̏̓̂͊͒͐̎͗̈́́͛͒͑̇ͥ͘ͅḁ̵̶̜̬̓ͣͧ̈́ͧ̏̅͊͘͟s͍̲͓̱̥̦̪̒̓̾ͯͣ͘ c̨̛̙̦͖̟̖̤̊ͫ̊̆̎̍̾͋́̊̓ͣ͟͞h̶̸̢̧̡̢̛̳̳̫̰̯̼̥̯͓͓̱͙̭͔͍̟̐ͮͫͩ̿ͯ́͊̏̍̄̀ͬ̚͘͜͠͝_́_ͬą̶̝̤̝͚̯̬̠̎͌̋͐͂̍̚_͗̏l̷̴̨̡̲̲̤͍͖̾ͪ̿ͩ̐ͣͬ͠l̷̨͙̫͙͖̬͚͕̥̻͕͉̗̗̥͇̄͛͛̈́͆͋ͨ̑̑͗̌ͪͥ̆ͮ͑̿ͥ̈́̀̉̈ͭ̀̆̚̚͘͡e̷̛̗̾_̶̧̬̮͕̪̩͔̥̣̩̱̲͔̳̭̖͔ͤ̉̌̎̀̃̐ͣͤ͆ͨ̊̒͗̒͛̂͡͝͞n̬̄ͥ̋ͦģ̶̡͖͚̼͉̫̟̠̤̬̻̝ͪ̂̏͑ͨ̉̐ͥͫͩͥͪ̿̉̈ͭ́̈ͫ̋ͩ̍ͥ̍̈ͪͬ̊͘͘͠͡ͅi̸̵̵̺͓̹̺̲̥̞̮̻̳̋̅ͩͤͦ̀̃ͦ͛̈́͗ͧ̓̇̾̒͌ͦ̿́̒ͥ͑ͫ͟ͅn̴̸̴̸̸̸̶̡̨̧̧̧̜͉̤͇̱̠̟̩̝ͬ̿̿͛̾͌͛̿ͦ̅̂̉̓̃ͭ͗ͤ̕͘͟͜͠ģ̴̵̛͈͔̜̲̙͔̟̝̘̲ͬ͋͌̈́͋̍̔ͨͥͯͧ̏͜͠,̴̢̭̥̤̫͎̹̰͇͔̼̾̇͛͑̎̓ͯͯ̀̚͟͟͟ b̧̋͜ú͈̯̋̒̄ͅ_̺̱͂́̏t̴̷̨͈͇̝͉͙̝͓̝̞̹͕̺̖̰̹̜̠̀ͣ̍͂͋̅ͫ͋̌̇̆ͮ̑̓̓̾̀͟͢͠ ṫ̴̝̎ͫ͋̌͒̆͋h̷̵̶̴̵̞̠͓͈̜̬̥̣̙̼ͨ̃̈́͆̏̂͋̄́̀̋ͦ̀̏ͬͣ̕͟͜ͅę̸̻̰͔̹̔͑͗ͪ̉͗ͧ͋̋͂̕͟͢͝ v̵̶̸̷̧̩̬̩̪̜̳̝̥̿̆͐͋́͂ͦͪ͐̿̍͒̔͋̕͜͜͡͠i͝_̨̰̠̠̞͚͇͕̌̔̏̕͟͢͡͝͝_̧͙̞͕̫̲͕̗̺͒̏̉́ͮ̈̄͘͝ȩ̵̵̴̸̡̛̛͙̺͍̩̯̺̲̺̯̝͈̲̳̦̱̼̣͑̃̔ͥ̽ͪ̒ͫ̎̈́͋͆̑́̾̚͡͞w̸̶̶̨̛̰̮̤̩͔̟̪͕̼̰̥̲̘̜̎̔̋̂̽͗ͤ͋̌͘̕͟͡ͅs̵̹̟̬̤̳͈͔̦̬̯͙͚̃́̍ͮ̉̑́̃̄ͪ̑͘͢_̡̖͔͖̬̾ͫ͝ f̢̰̣͖͓̲̱̩͎̄ͧ͌ͨ̈ͬ̽͊̑͂ͣͨ͘̕͞͝r͈͈̋́̓̚o̸̶̘͉̙̞̹̭ͧͨ͂ͮ̂̑̃̐ͨ́̾̚m t̖̻͕͕̰̻͋͑̔͑̿͋̎͘h̨̼̖͔̮̪͕̻͇ͤͪͭ͒́̽ͥͦ̀̑͗͢͢͠ͅȇ̵̸̷̢̡͖̗̞̮̪̼̦̝̗̭̙͖͇͔͇̮͔̰̮̝̮͈͔̥ͮͥ̔͌͑͋̈̇̑̆̏ͣ̚̕̕͢ t̟̝̫̼ͯͧ̚̚_̵̧̢͚̙̝̙͇̟͛͛ͭ̓͂̕o̰̖̩͈̙ͫ͆ͨ̂͘p̯̟̯͎͓͕ͫ̉̀́ͭ̈́ͣ͘ w̷̸̷̸̩̤̻̟͌̐̆̿̽͊̀͒̏̚̚͘͟͜e̢͈̝̰͇̹͆ͮ̈̎̆͂̉́̒̄̓́͌ͅͅͅr̷̴̵̷̝͈̺͙͕̦͇̬̥̘͇̥̦̱̲͓̳̽ͯͯͪ͑ͩ̋̋̒͗͆̈́ͭ̄ͮ̀̕͡ͅe w̵̛̻̟̦̳̺̮̪̖̝̖̳̺ͭ̆̾͐̎ͥ̊͒ͮ̅͒ͬ̈̍̋̅̆̈́̚͠͠o͉͚ͩ̓ͩ͘_̨̩̠̯͓̰͓ͨ̌̈ͬȓ̵̡̧̡̖͔͖͓̀̾̃͑̒̄̆͛ͬ_ͧt͎̗̦̘̦̯̲̻̉̿̅͗̽̈̉̊̚͠h̛͓̹̪͓̆ͯ̐͛̕͠ i̵̖̻̠̙͎ͪͩͩ͛͛̚͘͠ţ̶̴̧̧͙̼͎̱̖̳͕̠̯͐̽ͣͮ̔ͬ͗̆͋̆̒̇ͣ͋ͧ͌̾̚.͉̈ Ì̢̛͔͈͚͇̻̺̯͉̟̹̮̭͖ͬ̈̾̐͆̾͛́ͣ͜ͅͅ f̷̷͔̟̯͔͖̻̥ͪ̓́́ͯ̓̌̇̆͘͜͞è̳̼̱̝ͮͪ̔̀͌́͋_͎͎̯̞͕̙̖̬̮̥̾̒͑͌̊̿͂ͧ̈ͩ́̃͟l̴̢͈̣̙͙̹̈̐̃̔͘̚͝t̷̨̬͈̟͚̤͑̀́̔ͮ̄ͨ̓͐̌̉̂͠_̵̡̭̳̼̤̇ͫ̍̒ͭ̆ͨ͡ á̵̐ͬ gͨ̎͡r̷̵͎͈̲̯̬̍͊͛̍̄̚͡͝͠ͅḙ̸̵̺̰̼̺̮͈̮̟̙͊̃ͯ͋ͥ̔̈́͑͛̇͘ą̷̛̤̯̹͍͎̖͢͝ť͕ͧͤͪ̈̀̎́̏͝ s̮̦̯̎̕͟e̴̷̥̬̹͘ͅ_̨̩̮̗͔̭͍͂͊ͬ̅n̩͖͇͔̝ͫ̽̅͐̊ͣ̎̅͘͠s̴̷̴̷̢̧̩͈͈͖͕̠͉̪̳͕̬̳̈͐ͥ̑̋̆ͫ͐̇̋̇ͫͪͣ̏ͮ̒ͦͬ̕͢͜͠͠ͅͅę̢̛̩̝̭̠̫̟͉̪͎̱̫̣͎̻̍͂ͭ̐̀͒̃̉̈̎ͨͬͩ̓͆͗̑̇̐̕͢͟͝ͅ o̴̦̠̞̜͇̠̞͉͋̅́̇̌ͯͨ̀̓ͬ͐͜f̷͎̟͚̄́ͦͣ̽́ a̵̡̱͚͈͙̺̻̪̲̳̹̻̗̥̩͎̿̓́̿̓̇̉͐̽̐ͯͨ̒̿ͣ̿̀͢͜͞͞ͅc͓̮̯͌͒c̸̢̨͇͈̼̼̠̋̔ͥ́͐͐̉͐̌̄̚͘͢͠ͅͅo̴̪̮̹̦͍͔̟̲̲͎͈̿ͩͣͬ̎̏̈̒͆͐ͣ́͂ͨͭͩ͘͘͠m̵̭̣̗̥̖̤͈̰̩̰̺͑̍ͭͧ̽̑ͮ͋̀ͦͨͣp̵̷̴̶̴̱̙̭̪̝̣̼̊̃ͤ̊ͦͬͤ̽̿ͯ͛̈́̇͂̔̽̂̃͟͠l̡͕̫̖̠̪̐ͯͤ́̑ͨ͗ȋ̡͎̣͖͖͖̥͎̩̣͉́ͫ̉͋̾̏ͤͫͧ̒̀͟͠͡s̗̫̯̹͙ͦͣ̕_̫̗̹͎̤͉ͩ̿ͧ́h̸̛̻̗̦͎̫͙̪̯͍̯̹̉ͯ̎ͤ̈ͮͭ́͐ͦ͗ͥ͘͟͟͜m̵̹̝͈͐͆͂̑͋͐͟͝ę̵̸̴̵̪̻͎̼̜̻̩̘̹̠͈̺̭̽ͫ͆ͦ̃̋̔̉̽̔ͥ̿̇̓̾̈́̓̚̕̚͟͝͝ṋ̅ͥͬ̊t̶̹̹̞̬̝͎̩͂͊͋ͭ̆̌̓̕͘̚ ṙ̴̴̛͇̪̙̯̹̯̬͖͙̺̩͔̖͕̟̯͊̒ͩ͂ͧ͋ͦ͂̓ͬ͑ͯ̽̄͐ͣͬ̕͜͟͠ͅę̸̘̮͇̬̠̻̰̼͇̗̺̇̈̋̅ͪͨ͛ͯͧͬ̈͂ͤ̈́͜ͅa̸̸̷̴̷̹̻͍͙͈̲̹̥̖̟̟͌̿̅͐ͯ̔ͣ͋͑̑͛̿̍̚͢ͅc̴̫̘̺̻̳̤̦̮̳̄̊̍͛̆̌̌ͬ̑ͤͭ͒ͥ̄̅͝_̷͇̼̤̈́͆̀̒́̀̿͂̀̂ͅͅh͔̻ͭͫ͆͐ͮͤ͘i̶͉̝̠̬̗ͭ͋ͨͣͥ͗͋͒ͣ̍̌͡͝͠ͅn̘̄g̡̨̜͙̙̬̬͚͙̞̥̝̦̤͎̩͗͂̄ͤ̈́̇͗ͭ̽̈́͌̈́̕͠͡ t̶̶̨̢̜͙̱̫̣͍̣͙̱̼̟̏ͨ̔̈́͐ͣ̂̂͘̚͡͞h̺͑͠è̹̣̙̟͎͋̍̋ p̯̘̗͌̿ͮ͌ȩ̸̩̲̙̟̙̉͋͋̍̌̈́̑͗͞͡ͅ_̴̛̳͍͙̤̼͕̖̞͇̐̂̋̍̓̓̈͛͆̽̂͢͞_ą̵̴̴̬̮̖̤͙͎̖͍͐ͯ̌̔̄͆͒̓ͫ̈̔̔̃͒ͬͯ̂͆̽ͥ̓͌ͬ͘͟͠k̷̹ͮ̎͂̀ͯ_̴̶̴̛̙͉͙͈͉̖̲̲͑̀ͤ̅̈́̽͛̌̇͜͟͠͞ a̓ͥ̀n̷̴̢̧̡̟̺̝̙̫̼͍̯͎ͫ̆̿̎͆̑̀͗̚ď̛͖̩̙͓̺̣̹̥̹̺̳̤̐͂̅ͩ́̔̐͒͒͊̅͘̕͟͜͝͞͡ͅ e̴̞͎͔ͬ̐̀̓̿ͪ̕͟_̴̷̨̥͈̜̫̯̪̯̙͒ͬ͒͒̀ͨ̊̓ņ̵̨̣͓̦̟̗̝̊̄̓̊ͣͤ̈͟͝͡j̴̸̸̸̠̬̳͕̹̳̗͍̪̟͎̹̝̰̞̼͔̱̐̉͌̐̍͒͗̏͊́̉̉̐ͣ̌́͡o̥͔̗̗ͮͮ̐ͣ̆ͬ͊ͧ̕͟͞y̩̮̲̲͍̋͆ͮ̎̀̽̔͢e͕ḓ̶̯̻͖̗̬̖͈̝̳͐̀́͂̾̑̈̈́̊͋ͣ͑ͥ͂̀͐ͪ̂ͩ̚͢͠͡͡ t̵̨̪̪̖̽̀̒̄̾̈́́͋h̶̶̶̼̗̩̗̰̞̝̩̜̥̻̘͛͋ͮ̋͐̓̒ͣͦ̿̍̎͌̍̑͞e_̞̠̰̙̖̳͕̺̖ͤ̂̊ͮ́ͣ̿͗͑̿̏̏̌̋͂̚͞ p̸̬̖̣̮̞̗̤̳̠̳̠ͪ̇ͪ́ͤ̄̍̀͐͑̅͗̅ͪ͘͞ę̴̶̧̳̰̤͖̜̥̣̰̹͓̲̪͆̔̃̑͗ͩ́̒ͨ̐̑ͣͭ̏̐͘͘̕͜͟͡a̷̧̡̨̺̞̰͈̣ͤ̕͘c̠̼̼̲̪̳̼̘͒̔̔͛͘_͙̪̣̤̘͙͖ͩ́̀̿ͧ̑̍ͮ̌̍̋ͦ͂̿̚̕͟͢͠e̸̡̪͈͍̼̳̯͎͙͍͓̯̬̞͂ͣͪ͘͝͝͝fͥ͡ü̵̧̠͎̖̤͉̺̫̩̝̪̯̟͙̝ͨ͋̐̂̋ͭ̔͛͑̎̃ͬͤͤ͒̋͜͠l̶ s̶̡̰̼̺̳͉̯̭̲͍̥͎̭̀ͬ̌̌̉̐̀̚͢͞u̺̱̯͒̂͗͜͝ŗ̵̹͖̹̮͙͔̹͌̆̂̊͆̃̔̓͠r̸̸̡̨̤̟͎̥̔͗̈ͤͪͫo̶̥̭̰̭̦̭̩̘̞͓̦͖͒ͧͥ̔̿ͯ͆͛ͦ̎̅͗̈́ͯ͋̕͟͡͞͠u̵͌̍_̫̤̠̮̦͉̱̼̒ͭ͗͊͆ͨ̽̎ͮ͘͡n̢͎͖̹̼̝̏ͭ͋̿͐ͩ͋́ͪ̕͜͡_̧̛̬̗̗̳̰̫̅̽ͮͮ͆͋ͨ̄ͬ͟͝dĩ_̸̵̷̨̛̻̫͔̹͉̮̗̘͇͍͙̮̼̦̣̟̫̹̭̲̤̃ͫ̔ͭ͒͂ͥ͛̎̄͗ͨ̌̕͜͡ͅņ̶̷̶̡͕̯̪͇͙͉̼̗̬̳͂̋̅͋̋ͤ̈́̔̄̾̂̂̿̑͠ͅģ̷͕̽ͯ̒̓̑͒̃̏͑͋ͯͯ͌ŝ̸̢̯̭̬̲̹̖̈̐ͤͤͧͩͪ̿͛ͤ͝.̸͎̰͕̟̠̰̻̖̙͇̮̮ͫͭ́̎͒̔̓͋ͭ̎ͨ̎͘ͅ Ţ̷̵̸̴̲̫̘̩̜̟͕̫̬̣̬͖ͣͤ̑͑͛̆̒͆̔́̀̏ͦ̇ͣ̽̉̕͘͜͢͜͜͠ḩ̵̴̡̨̨̨̢̜̭̥̥̠̟̱͇̦̬̮̏̂̿̑ͨ̉̔͛̊͛̊͊̃͢͢͢͠e̵̴̵̶̼̺̝̝͔̼̦̦̞̘̮͍͍̦̦̣̔̇́̀́̉̿ͣ͛ͥͦ̂͐͊͜ a̷̡̞̘̝͍̱͖̼̙̮͓̎̂ͣ̈͊̓̉̃ͯ̂̈́ͩ͌̚͘͜͢͞͡͝į̴̸̴̢̘̝̪̗̜̜͒ͯ̌̈͑ͅr̟̹̣̬ͩ̔̆̌͂͋ͮ̚͡͠͝_͓̳͊́͠ w̴̹̣̞̠̳̪̣̳̼͖̘͛̑͑̓͋̋͋̌͌̾ͫ̆ͧ͂ͤ̐ͦ͢͡͝a̺̱ͨ͗ͫͭ̂s͈͈̥̟̗̱͂̄͛͒̍̃̈́̉ͯ̚ c̵̷̢̧̨͓̳̭͈̤̬̩̼ͨ̂ͥͮ͝r̡̥̼͈̉̐ͯ͌̿̆͜͡į͚̮̪̣̟̭̙̹̲̗̈̄ͥ͒̊̋̄ͮ̕͢s̭_̠̳̬͉̟̑̊̃̅̏ṕ̛͎̙͕̮̻̻̞̜̟ͯͧ̿͂͗̅͆̉͡ͅ_̸̛̭̤͕̦̲̩̜̔̍́̔́̋ͬ̀̕͢ͅ a͎̤͇̺̫͔̘̙̣͉͔̬̙̰̥̽̒͊̐ͭͭ͋ͧ̅́̅̚͘ͅn̸̡̧̯̯̻͓̻̻̰͇̫͈̱̝͖̺̥ͬͯ͋̊̾̎̋̆͛͗͂́̑͋̆̈́̓͘͜͜͜d f̵̭̳̞̯̯̖̍̓́͌͑̃͋̃ͨ̀̐ͬͫ̚͡͠r̸̖̮̩̬̙͒ͬ͐͊̍̀̇ͣͤͩ̃́͘_̴̷̲͓̲̮̣̳̎ͮ̈́̀͒̉ͤ͌ͫ̈̂̄̏̉ͮͯ͝͝ẻ̵͖͍̙̟̖͍̣̲̙̪̫ͭ̽̐̌̉ͯ͛̉̀ͯͩͬͥ̕͟͟s̸̞̜̗̻̝̮̣̬̲̤̰͌ͨ̏ͣͮͧ͛ͯ̕͘͝h̕,̡̜͇̯̠ͩ̇͑͌͐̀ͩ̄͟͟͟͡ ą̨̛̰̻̜̝̥͎͚̟̣̖ͫͭ̃͛̑͆̀̑̽̍̉̀̚͝͡ņ̶̱͈̼̤͇̰̙̪̯͓͕̖͌̂̈́̽͂̀ͨͫ̈ͪ͋̑ͥ̂̿͒̌́̏ͣ̄̎̕͟d_̵̷̢̧̛̦̯͖̪͖̻̪̜͎͖̬̻̅ͦͭ̆ͯ̍̿ͫ̈́̍̊̐̂ͤ̕͢͠͡͝ t̷̶̡̛͙̟̪̥̲̮͙̖̳̫̐͛̎ͥḩ̶̮̲̭͈̜͍̬̩̰ͥ͛͊̋͋̀ͪ͑̄͋̚e̛̹̭̙̟̰̥͙̼͔̤̺̘͑ͤͮ̾ͦ͛̽ͦ̇̇̌ͧ͂̽͜_̧͍̩̞̐̈́̈͗ s_̝̳̞̜͓̝̼̯̔͌ͬ͑̋͢͝_͔͉͕̠͇͓̉͑́̿c̷̶̢̙̻̺̭̭̯̥̜̪̓̔̏̇̌̌͒ͨͬ̌̌͒̌͞͝͠͝ͅe͔̣̲͓͔̊ͤ̍̋̄̾ͩ̊̚n̮͐ͣ̒e̴̯̤͉̯̗͎̯̮̣ͩͬ͐́̍ͥ̚͘͠r̶̷̷̢̧̗̣̫̩̗̹̗̯̰̦̭̪̙̟̅ͤ͐ͦ͑͂́̃ͮͤ̔̽́̒̆ͭ̑͒ͭͮͫͪ̕̚͠͞͡ͅy̷̴̢̙̫̹̬͌͑ͯ͆͂̃́́̕͞ w̴̶̷̨̜̬̝͖̗̠͓̹ͩ̀͑͟͠͡a̧̗̝̣ͮ̔̈́͌ͥ͑́ͩ͟͝ś̶̠̪͙̮̒́͂̇̐͊̌̚_̢̛̛͖̫͖̝̲̙͔̣͉̩̣͇̽̍̍̋ͦ̊ͦͦͣ͢ b̢̢͔̬̯̞̹͚̹̦̌͛̾ͨͥ̅͋ͮ͑ͩ͆ͪ̐ͮ̍ͧ͜ͅr̸̨̞͎̣̹̠͎̝̪̬̠̝̯̺̘ͤ̊̌ͩͭ̓ͣ̌̓̃̍̾̂͐̂̾͊̅ͮͦ́̓ͩ̎͞͠ę̵̶̸̸̶̥̩͍̼͖̲̰̩̹̼̟͐͗̈́ͤ͗̈ͭ̐͒̎̌̓̄̀ͬ́̃̽́͂͐̚ͅa̝̪̯͎̘̱̠̭̟͔̒͆̾͌ͬ̍ͦ̆͂͞͝͠ẗ̜̟́͆̓͒̀͘͞ḥ̀_̴̴̹͇͔̬̘̫͖͉̞̱̙̳̘͆̃̎͑̌ͥ͒̓͆̀͊͆̎̒̋ͭ̏̋͒̇̽ͧ͘̚͟͟t̷̵̶̨̨̲̪̦̞͇̥͍̱͉͕̪̲͕͎̙̻̠̜̤́̎͌͌ͭ̃ͣͮ̍̊̅͋̓̈͐ͮ̌a̧͇̟̓͋͟k̜̞̰̟̬̱̦̗̮̘̗̯͚̑̇̔͗̈͐͐̿̂̔̈́͌̏̅͘͢͜i̭̫̽͗́͂͡_̫͛ṉ̤̐ͅ_̴̨̨̡̰̦̠̝͕̬̙̱͇̩̆̆̈̾̃ͯͫ̔̂́͒͛͂̊̏̽͐̅͐͋͋͐ͯg̶_̶̶̡̭̮̼̱͚̙̰̼͊̔ͨ̽ͬͧͮͥ͌̅̆̇ͬ̀̍̈͗ͮ̂͆͘͜͠͝͡.̵_̶̬͙͔͎̻̮̙̥̖̰̟̜̟͕̤͉͚̫̊́̾͊̄̑̎ͭ̋̏ͥ̑͊̕̚̕͢͞͡͠ͅ")
                    TextSection(date: "October 23, 2021", text: "V̸̸̥͇̬͈̣̼̊ͯͬͪ́̉ͧͭ̓͝i̴̧̨͔̬̜͈̩̣͕͔̗͈̗̙̗͓̜ͥ̆̅ͫ́̐͋͂ͧͤ̔̆̇ͣ̓̆̔͂ͮ͐ͥ̇̑͢͠͞s͙͎̓ͩ͑ͬỉ̶̸̛̛̟͖̮̘̪ͫͮ̂̏͑́́̚̕͞ͅt̢̜͔̺̺̙̔̑͂̒̐ͥ͐́̆̆͒̊́͝͝͠_̵̙̠͙̰̞̬̞̥̹̐̾̍̿̓̂̌͟͟͞e̶̡̞̮̜̦̥̜͉̩ͣ̏ͨ͗̈ͣ̅́͡͝d ţ̴̡̞̳͙͍̖̫͇͎͍̦̱̤̲̪͉͙͔̜̲̬̇̑̊͋́͒ͭ̓ͪ̄͐ͦ̑͛̓̓ͦͪ̏̒̃͘͞h͓ͣę̷̗͎̖͎͓̹̦̙̠̼̼͓̱͎̥̼̹͍̱́̄͑̇̿̈́̔̎̐̀̏̓͛͝ l̯͌̑ͣ́̉_̸̴̡̡̨̧̻͖͈͖̥̬̠̺̥͌͛ͦͮͮ̄ͭ͆̈͛ͧ̽ͮ͐ͭ̿̿̄̂̕ͅö̷̷͉͔͈̥̻̮̝́ͯ̀̓ͦ̿ͤͣ̂̉ͯͩͥ͜͝͝cạ̢̟͉̃_̸̶̨͖̝͙͋͊́̅͊̎ͨ̓͂͟_̋̌l̠͉̟̖͖̣͓͇͎̟̠̲̊͐̍̀͆͗̏́̏ͭ͒̽̽ͭ̃͘͘͠ͅ_̈́̈́ͦͭ͟ a̤͙̻̼̮͍̱̙̱̬͎̰̻͔͎̻̫ͩ͋͛̈́̑͂̑̓̑̄͒̾ͮ́͌̑̃ͣͯ̈ͪͫ͐͘͡͞͞͡ṟ̡̮̠͕̗͇̳̲̳͍̓̓̒̂͋̀̅͗ͣ̌̿ṱͪ m̶̸̨̱̗̠̩̖̘̖̳̩̪͉̓ͭ̋͆ͫ̓̕͟͡u̵̅̓_̃_͉̫̤͗̐̄ͭ̄͝͠s̛̪̙̦̗̺͂̆ͦ̅̽̀̇ͧ͋ͪͩ̈́̊ͦ͐̈̇ͨͨ̏͢e̡̝̳̍̃̈́̓ͥ̽͘͘͘_̷̵͉͕̦̰̥̻͍̋̿ͭͣ͗̓͋̏̈́͆̈́͑ͥ́̂ͧͥ͘̚͜͠͡ͅǔ̸̢̧̙͓͉̝̮̹̟̯̣̖̮̰̠͉͈̺ͤ̑ͮͭ̅ͨ͗͂̏͑̃ͨ̌̂̄͐͗̓̃̈ͫ͘͢m̴̶̷͎̞̠̬͍͚̟̄̒ͤ͒ͮ̐͜ t̴̢̗̦̥͍̼̺̭͖̜̩̗͖̉ͨͫͤ̈̉ͬ́ͭͥͫ̓̔̕͞o̢͖͎͎̮̲̩͕͚͚̭̦͓͙̱̍̄̆̃̀̀̍͊̈́́ͦ̊ͫ͢d̷̙̹̤͚̯͎͎̝͎̭͕̤͋̍̄ͣ͋͋̃͌̈́̌ͤ̋͗ͬͯ͢͞ḁͤ̔̀ͩͣ̃ͣ̔ͣ̏ͨͩy̴̶̢̥͔̠̰̣͈ͥ̌ͮ͊͘_̛̛̞͓̼͔̱̣̘͓̳͇̐̎ͪ͒ͪͪ̑̅̆. T̢̛̳̩͇̺̜͈̬͇͖̃ͣ̾͆̒͐́͐_̷̶̢̧͈̖͖̝̘̦͇̪͚͗́̋͂͛̅͛̈̀̓̕͞h̷̸̩̳̥͉̝̻͖̰̻̫͑ͥ̅ͤ̏̓͂̉́̍̊̒̐̒ͯ̎̈́ͫ̍̕͢͝e͖_̶̵͎̖̤̬̙͖̫̳̣̠̱̫̲̂͗̈́͑ͤ͌͂̎ͫͮ̔̈̊͊͐̋̐͛͘̕ỵ̷̸̬̘̥̳̳̳̩̟̘̳̊̌̂͗̑̎̾͆̈̊̈́͊̽ͦͧ́̅ͥ̄̌͊̊ͫ͆̇̕̚̚̚̚͘͟͟͝ h̴̷̢̭̮̟̯̦̱̓̂̀̐͊̅̎̊͐̓͘͜͞_̴̩̝ͣͯ͊͊͘a̵̧͉̝̳̲̯ͥ̅̾̔̽̐͆́ͤͩ͆͒͡v̢̧̢̻̀͆̀ͥe̸̡̡̖̳̜̟͇̞̝̪̘̺̘̫̾̅ͬͫ͑͊̂̊̈́ͩ̆̔̂̐̔͘̚̚͘͝ͅ a̡̢̹̭̥͇̮̜̲͇̤̜̪̤̯͙ͮ̊͂͌͊ͫ̏͊̓ͩͪ͛ͮͨ̊̄̕͜͟ ǹ̵̢̞͓͕̝̲̳̼̪͆̈́ͪͫ̃͛ͩ̓̌͒ͣ͊̄͌̉̅̚̕̕e̡̛̺̱͉̤̼͈͉͔͈̭̹̊ͬ̑͆̒ͫ́̌̎̕̕͟͡w̶̸̵͚̣̮͉̻̗̦̮̖̞̠̘̱͗̆͌̓ͨͣ͐̾ͯ͗͌̚͝ ẽ̶̢̦̮͎̮̎ͪ͒̒ͬ͟͞͡x̷̴̧̘͕̔͢ḩ̙̞͇̌͢͡ͅį̸̺͎͇̖̠̩͎̹̻̼͖͔͔̩̓̓̔͂ͪ͐͆̒̇̆̾ͯͬ̀ͧͤ̒͘̚͝ͅͅb̡̛̘̳̎ͯ̾͊ͬͮ̄͘͞i̶̴̷̡̨̧̡̳͓͙̬͇͖̲̥̺̝̘͈̿͛̄͆̒̌̓͆̌̐̌̚͜͢t̵̨̡̧̨͎͚̖̟̝͎͖͓͇̤͙̺̙̯̪͌ͥͦ͑̽ͫͭͣ̋̒́͋ͧ̅͂̓ͩ̾́ͭ̀̓̕ t̴ͨͅḩ̷̯̭̳̟͇̦̼͎̪͊ͭ̑ͭͩͫͮͣ̽͗̕a̎͡t̡̳̻̞̫̬̯̥̬̦̼͋̆̍̈́͐ͮ̾̒̐͆̋̈̕̚ͅ Į̧̛͎̭̳̼ͣͫ͋́̈́̐͂ͦͥ͞'̬͓̞͎̩̺͓̟̮̙͇̜͓̱̉ͤͦ̃̂̂̔̚_̡̤͕͕̗̯͇̰̹͚̱̓̇̾̀̅͛ͥͫ͊̚͢͞v̰̬̹͚̘̞̯̭̀̏̎̈ͣ̽̐ͩ̎̇ͨͦ͋͒ͥ̒̾̿͟͝ḛ̴̵̶̸̛̛̮̖̻̗̖̫̤̫̘͖ͬͦ̿̋ͤ̾͂̆̀̃͂ͯͫͭ̇ͫ͛̊̇ͫ̈͢͠ b̵̖̬̩͚͕̀̋̄ͪ̈́͂̇̒͘̚͟ͅẻ̷̶̛̬̮̳̮̦̑̋̉͗̓̍͛͌͋̉͟e̞n̷̨͓̮͍͇̗͎̍ͩͯ́̒͠ w̗̳̘͈ͯͯ̂a̢̗̬͍̦̱͖̹͇̯̹̖̍̈̀͂ͯͦ̋̃̕͡ņ̵̟̪̯̗̯͉̙̠͎̣͇͆͊ͩ͌̊̒̔̒ͨ̀̒ͥ͢͟͡t̴̶̵̡̛͔͔͖̯̭̗͔̜̳̘̤̥́ͭ͒̉̒ͭ̋̀̀͋̃̀͋́̎͊̀̎ͬ̒̾͂̕͡͠î̛̛̖̠͉̺͎̝̠͇̣͓͓͚̰ͨ̈́̊̄͒͑̍͆ͯ̓͛̈́̂̀̀̐̿ͦ͟͢͡͝n̴̶̸̡̢̡̯͇̤͕̟̺͖̹͎͚̫̠͖͙̰͕̱̤̺̉̈́ͯ̆ͤ͒͋̆̇͊̃͆ͩ̅̌̏͂̕͘̕͜͠g̷̸̵̖̘̮̥̜͔̹̗̖͋͂́̊̍̂͌͢͞ͅ_̷͎̗̭̐̍̎̏̀̍ͤ̔ͨ͢ t̮̬̜̻͓̽ͩ̄̋̈́́ͥ͋̑̕ȯ̡̢̢̝̰̠̘͉̘̘͚̮̜̘͍̜͒͐͗́͂̐̑͆ͮ͌͊ͅ s̱ę̷̶̶̨̧̤̠͇̺̜̝͙̤̹͊͂̃͑͂͞ͅe̶̷̡͓̻̼̜̩͙̮̟͔̘͈͙͈͖̫̊ͬͩ͑̑ͥ̑̓̓ͨ́ͮ̇ͨ͆̓̀͟͡͡.̡͙̞̲͍͈͖̥ͮͪͮ́͒̈̐̔ T̡͙̲̦̥̣ͤ̏ͫ̆͜͟͟͝h̷̶̡̡̛̗̤͎̼̥̫̝̯̼̤̜̻̙͔̖͓̦̮͊̂̓ͩͭ͋ͧͩͬ̉̑ͧ͆ͬ́̔̿̚͘͜e̸̸̴̢̨̛̛̱̰̞̳̜̻̣̲̫̭̝̞̻̝̒̍́ͮ̋̏ͬ͋ͦ̎͒̇͐ͯ̍͊ͧ́ͩ͟͞ ả̧̛̞̜̫͋r̨͎̞͙̰̹̘͓̗̩̀̎ͤͯͤ́̓ͣ͗͟͞͝t̨̡̘̳̣̻͍̼̱̟͈͔̞͉̞̗͑ͥ́ͪ̒̀̈́̒̓͒͒ͣ̋̒̓̊̓͂̚͢͜͞ẅ̢͕̟̻̥͖̟̥͕̫͉̆̊̅̾̑͆̎͢͠͡o̱͝ṙ̴̢̭͕̤̟̤̥̰ͭ̔͂ͥ_̢̫̮̠̯̺͔͗͒ͩ͌̓ͯ̂͐̀̕͟͟k̵̸̴̷̨̛̳̦͓̬̦̯͖̣̭̳̙͔̗̜̻͕̗̰͕͋̇́̉͒̎ͣͥ̃̍̌̐͒̉̇͑̿͘͢ w͉͔̮̍ͭ͒̕͝͝ͅ_̷̸̢̢̡̧̬͕̜͈̫͕̗̺͍͓̜͓́ͩͩ̇ͨ̍̀̍̆̉̑͘͞ͅa̸̵̛͎̓ͥ̿͞͡s̵̢̢̨̢͍̲̭̰͚̜͙̺̣̟͚̯͚̬̦̭̀ͨ̊ͭ̅͊̇͒̿̇̍ͫ̅ͤ͘ ş̡̜͙͔̻̣͔̫͎͇̰̱̼̜͆ͦ̅̌͆̂̎̒̐̎ͮ̔ͣ̆̽͆ͫ͋̑͠͠ṫ̴̸̵̸̨̻͚̺̫̜̬͙̱̒̊͊͌̀̂͛̈́͛̄́͘͘͢͠_̣̏͠_̶̇ͣ̃ü̵̵͉̘ͦ͆n̶̨̨̛̤͙͚̱̻̤̲̰̜͙̣̯̣ͥͬ̋ͤ̔͒̿ͧͤ͗͆ͣ̐ͯ̒̂̚͘ͅn͈̫͍̏̒͂ͣͫͧ̕ì̴͎̙̗̰͋͐̈́͗̂͂͜n̝͚̘͇̤̰͓͖͍̦̦̻̟̦̋̀̾̂ͪ̓̈́͛ͥ̉̑ͯͥ̃̎̍͌̅̒ͥ͆̅͟͠ͅģ̸̛̭̪̩͇̯ͯ̽͒ͭ͛͒͘,̸̨̧̠̝̹̘͇̪̗̭̦͓͈͈̦̻̈͐ͫ̅̏͒̀̔ͭ̈̿ͬ̀ͥ̐̐ͯ͗̚̕͘̚͞ a̧̗̯͚͙̖̓̒̄ͦ͊̌͋̋͢_̶̧̪̖̟͑͛ͭn̵̡̧̤̹͓̣̥͉̼̝̤͍͖̘̓ͥ̏̇̀ͣͣ͐̂ͧͬͬ̅ͩͥ͢͠͡d̢̹ͫͯ̽̏̓̄ I͔̰̤̮͔̼̞͕̩͚͖̲͈͎̺͉͐̇͐̔̇ͥ͋͋ͫ̀͊̾̆͌ͯ̉ͧ͌̿̔̆̊̈́̕̕͘͞ f̴̷̜̤̩͍͚̫̥͖̟͗̈́ͪ́̒ͧ̓ͣ͢͡ę̬̹̥̻̦̤̼͈́ͮ̑́̐ͥ̔̾͢͢l̶̴̶͚̺͕̫͓͓̯̭̞ͮ̐̒̊ͪ́̒ͤ͋͊̓̀ͣ̅ͯ̈͟ţ̷̘͙̭̝̳͖͙̏̐ͩ̈̇̓̿͘ i̷̸͓̖̪̙̭̪̲̪̲̦̱̥̻̱͋̓̂̔ͦ̏ͦͤͭͭ̑͛̇̋͛̎ͨͣ̌ͨ̃̉́̏͢͢n̶̸̢̧̛͖̖̪͍̻̩͉̳̮̼̬͔̗͙͓̖͓̿̃͂̆ͧ̽̏ͫ͐ͨͩ̔ͤ͑̓̐͆̔͟͟͝͠͞ͅs̴̶̶͕͔̮͍̘̭͉̑̍́̏ͩ́͂͛̎̐̎̏ͧ͘͝ͅp̝ͪ͑͡_̸͋ͭ̀i̴̷̶̛̦̱͕̼̦͚̺͎̥̠̍ͫ͛ͨͤͤ̓̔̉̃̔̽̂ͤ̈́͢͢͢͠͝ͅͅr̵ͤ̏_̵̨̞͙̙̥͚̯̘̈ͥ͗ͯ̚͢e̡͎̠̞̐͒͋͆̃d̵̨̨̩͈͎̳͍̠͍̠̖̥̅͐ͤ̐́͋͋ͤͮͪ̌̕͠ t̷͚͔̝͈̓ͯ̽ͧ̾̍_̸̧̠͕̲͍͍̙ͥ͂̍̍́ͨͫ͂ͯ̃̓̌̏̋͂̇͊͜͞ͅŏ̷̡̜͍̻͖͌̿ͭ̉ͦͩ̔͟ c͖̤̥̤͈͙̝͙̺̣̤͋̓̏́̈́̿̂͋͌̍ͯ̀ͣ̾̒́͗̚͘͟͢͜͡r̷̶̵̴̢͚̠̹̙̪̫͕̳̝̟̫̬̈̇̐̑̃ͬ̔͋ͩͣ́̊͛͌ͫ̎̊ͪ͑ͦͩ͌͗̋ͨ̚͟_̅͠e̵̸̫̞̞̲̼̩͚̺̖̝͛̈͗̉̓̓̅́ͯ͟͜͠͠_̵̧̮̘͙̳̍̀̉̽̎͑ͥ́͐ͫa̵̴͙̜͇̟͚͕̻̪̭̖͍̫͈͎͚͎̰͙̹͍͈͐́̉́̀̽ͦ̓ͦ͂ͦ̇̋ͫͦ͘͢͞͝t_̷̢̼͙͇̩͕͎͈͎̭̓̍́̔̀̃̔̓̓̾͌̑̋̑e̵̶̴̢̢̬͚͕͚̙̤̝͎̹̞̳͕̥̹̒̔̓ͯ̃͒̔͑̂̔ͫ̒̑́ͨ͒͆̀̀ͯ̐ͦ̀͘͡ s̴̵̩͉̞̳̠̋͐ͯ_̸̴̷̷̧͖̰̩̝̬̟͍̳͓̑ͭ̀ͧ͌͋̆͂͒̄̈́ͣ̂ͯ̚͘͘͘͜͞ͅͅo̷͈̼̟̲͉̿ṃ̸̷̶̵̧̤̜̳͍̻̗̠͔̥̫̝̜̹͊̀ͮ͛̆͐̈̒́͑ͧ͛̅͊̋̎ͯ̌̓̚ͅe̡̘̗͇̻͌͊ͯ͗͘t̢̩̲̳͉͐̔ͪ_̢̨͇̬͉̫̫͍̏͆ͩͣͩ͐̇ͩ̊ͩ̃̀͜͢͝ẖ̸̡͇̒̈́̋̋ͅí̵̴̬̝̣̣͎̳̣̮̠̃ͮ̈̋͛̃̾͆ͩ͡n̸̛̺͈̦̩͙̻̬̟̮̯̠̎̿͊ͭ̍̽̑͛g̙̓͟_̶̸̡̢̧̢̩͍̝͈̲̫̹̟̹̝̗̤͓̬̿̍ͩ̇̐̽͗͑̏ͨ̔ͬ̂̓͌ͬ͌͡͡͞͡ o̵̵̧̨̨̭͈̗͔̳̬̼̤̩̹̬͇̙̼̹͓̹̺̳̲̦̒ͫ̀̽ͨͪ̉͑ͣ͂ͪ̌̆̒̌̌̀̕͢͠f̧͙̬̮̭̲͉̥ͮ̊ m̛͍̹͎̫̲͕̓ͬ̇̓̃̌́̌̾ͤ̆͆́y̵̮̅͐ͮ̈͐ͪ̀̀͟ͅ_̥ ȏ̷̘̼̣̘̮͔̮̏ͤ̾ͨ̈ͫͪͦ̿̉̄ͦ̍̄͗́̍w̸̵̧̰͚̯͔̱͙̼̦̝͓̗̟̖͋̋̎̎͆ͩ̎̀̐̎́̄ͩ́͊͂̍̋̕͜͞͞͡n̷̶̸̨̢̢͈̦̠͖̮̭̙͖̥͚͍͓̘̘̗̟̉ͯ̓̏̅̈́̄̎̽̅͋̆ͦ̎͑͘̕͡.̞̬̣̥͇̟͉̦͗ͬ͌ͤ̋͊̚͝ I̶̶̸̧͕̤͈̖̩̙̮ͪ̑̏̌̅̓̿̃̒̓͊̈́̍ͯ͐́̈́̉ͮ͆͂̚̚̚͢_͍̺̳͎̩͌̇̀̎ ş̵̳̟̼̰̱͎̑ͧͦ̄̽͑̆ͮ̐͠p̆e͙̻ͨn̛̝͙͈̥͕̐͋ͯ̂ͧ̑́ͧ̿̄͜t̴̷̨̡̹̖͔̙̺͈̟̼̟͇͙̠͗ͧͧ́̔̋͂̅̉ͨ̓́̉ͪͯ̍̃͗̀͛̑͘͟͞͝͡ h̵̵̷̢̼̲̠̞̩͕̥͚̣̥͖̭̝͍͈̼̓̽́ͥ̐̈ͭ͑́̀̾̾ͬ̓͊̑͑͗̾̿͒̕̚͘͢͠ͅo̷̢̳̤̖͔̘ͦ͗̄̉́̃̓̄ͤ̃̆ͬ̏͂͛̐̃̚̚͜͝ư̢̢͙͙̗͈̖̘̳̘̰̱̹͑͂̓͂͐̐̎̓͛ͨͬ͋͝͝ͅŗ̻̗͎̱́̂̀ͪͤͬͥ̂̎ș̮͒̚̕̕͡_̙̪̗͉̣̤̻̉̽̿ͤ́́̈́͆͜͟ͅ ẇ̥̺̪ͥͦ͜aṇ̸̡̢̨̡͎͔͓̩͕̞̜͇̤͎̼̲͔̜̪̒̈͌̏ͧ̀͗̆̂̊ͭ̓̂̔ͫ͘̚͡d̵̡̩̞̘͕̳̻̥̲̞̰̱̉̎͛̎ͭͬ̍̅̀̾̈́̏̀ͭ̚͠ͅȩ̷̶̴̨̨̛̜̖̝̭͈̼̲̓̒̅̎ͬ̽̓̒̃͗ͥ͂͡ŕ̸̵̢̼̖̦̯͕̲̰̰̼͓͙̻͙̖̬̓̐̊̀̓̀̄̓ͯ͗̌́͛̐̈́̈́̒̽̓̃͜i̸̫̰̥̟̲̥̩̮ͬ̿͒͆̈́́̍̈́͢ͅṉ̘̻̩̝̬͛̾̋̓̔̌̃̎͝͠g̶̡̭͉̦̏ͩ͊͢_̴̵̨̹̪̣̦͓͙͚̰ͤͪͮͨͥ̊̆͋ͭ̌͠͠ͅ ṫ̸̡̡̠̹̫̣̙̠̩̭̣̳͉̹͛́̓̚͜ḩ̢̢̬̮͚̯͉̤͎͙̯͔̇̄͐̿ͮ̓̇ͦ̑ͣ̈͜ŗ̵̷̵̵̛̗͓̪̞͉̰̖̙͚̝̯͙̯͕͈͖̓͊̑ͩ́͒ͣ̓ͬ̈̃́̐̀̈́͐͆ͭ̽ͩ̚̕͢͝͝ō̧̝̭̫͕̯̪̞̝̓ͫ̉̀̋̌͆ͩ́̈́̀̃̽̇̑͐ͪ̚͜͠ù͔͈̟̑͂ͣģ̠͉͇̣̾͑ͥh͙͚̼̭̄̇̊̔̽̉ͮ t̸̡̲͕̼̤͚̭̫͉̳̭̲͎̥̲̟ͭ́̆ͩ́̂̓̐͐̎̑͜͝͞h̜̑̈́́̓͂e̵̴̢͓̮͕̗̦̥̤̗͚̟͚̫͚̖̠͚̼͊͗͒ͥͬ͛͛̽́̔ͨ̊͛͟͠_͇̮̘͈̓̅͋̿̿ g̶̷̨̱̹͚͎̫͔̤̖͓̫̰͈̺ͨ͐ͩ͛̔͂ͯ̔́̊ͬ̂ͩͬ͜͢͠͝a͊ͧ̊l̴̵̶̛̘̫̻̺̝̲̫̭͉̦̠͙ͦ̒̿͆ͦ̾̐͋ͪ̾̊ͦ͆͑̔͐ͩͣ̍͛ͦ͂̀̒̚͟͟͜͜͠ĺ̸̢̼̪̙͚̝̱̱̞̙̗͓̥͎͔̘̦̋́ͬ̈̑́̏ͬ̏̐͐̒̇͊̐ͣ͐͂ͮ̓̕͢͜ͅe̶̶̸̵̡̛̞̫̙̜̱͙̳͓̼ͮ̏̄ͫ̔ͪ̑͛ͤͯͨ̓͗̓̔̂̅́ͭ͒̈́̈ͪ̂ͦ͘͘̚͜r̶̢̢̢̗̫̼̺̠̮͚̺͉̫̊ͬͪ̿̆ͣ̓̆ͫ̇͆ͭͮ͆̕i̶̩̺̰̻̩̮̯̞ͨ̓̈́̾ͫ̒͐̓̉͗͛͗̀̂̔̀ͬé̴̸̷̵̷̡̢̯̻̘̭̱̟̹̼̲͇̂͗͐ͣͦ͊̉͒ͫ͆̇̽̏̓̈ͭͥ̍̂ͣ͢͢͡͞͠ͅͅͅͅs̷̟̒̅ͨ͒̾̓̓̄̋́̐,̶̡̡̫̭̟̲̘̦̠̮̻̲͚̮́̊ͨ͆̎̐ͭͬ̉ͫ͛̚͢ͅ a_̟̽͟͡_̶͖̫̹̫̥̬̃͂̔̉̂ͪ́͋͊̀͞_̛̰͈̞̘͓͋͗͌̓ͨb̌̿̽̓͊͝s̵̸̸̢̠̼͉̻̺̣͙̰̰͈̯͉̣̯̹͉̞̟̄̌̉̃͊ͫͣͪ̈́̎͌ͪ̄̓́̑͆̒̋ͤ̐͟͜͠͝o̶͔͈͖͇̝̻̳̜͆̊ͯͪ̂̌̉̈̾r̴̛̬̭̟̻̉̔ͮ̈ͮ̀͂́ͬ͢b̵̴̴̨̛̠̹͍͓̰̫̗̤̰͓̬́̃̅̔̀͛͂ͨͦ̅ͭ͛̉ͯ͌̎̆͘͜͝͞ḭ̶͉̼͈͙͕͇ͮ̄̀ͬ̌̽ṋ̽_̴̶̡̩͚͕͈̮͚͔̘̼̟̯̜͒̀̃̽́̃́̀́ͣͮ̃͑͢͠͞g̹ ṫ̖̖͘h̸̟̰͖͕̗̤̄͂̉ͬ͊ͯ͂͆͗ͣ̔ͩ̕ḙ̛̫͔̟͈͚͔̥̮̜̑̋ͥ̉ͥ̇̌̍̒ͫ̋ͯ͜ c̸̵͎̯͈͔̼̋̉͋͐̔̓̉͘_̼ŕ͋ea̵̡̳̱̭̙̠̘͇͎͇ͯ̌̂̽͌̀͌͂ͪͨ̽̈ͤ̓̓ͦ͊ͨͥ͐ͯ̽̃̈́̈͘tͨḭ͎̼̪̎͒͢v̵̷̪̠͖̜̳̙̮ͫͣ̒̊̄͗̍̍̈̀̽ͨͨͤͣ̕͘į̸̵̷̧̢̧̛̳̻̭̘̰̮̻̲̭̠̪͉͕͌̾̋̿͛ͯ̇ͭ̌͛͑̓̃͑́͂͂͛͞͠tͤ̈͞y̷̴̴̶̧̛̬̦̫̗̮̭̳̲͕̮̝͚̩̬͓̎͆ͤͤ͆ͮ̄ͪ̈́͆͊̀͘͢͜͞͡ͅͅ_̗͑͘͞ a̷̡̱̞̳̖ͪ̕ņ̷̶̨͔̯͎͇̞̳̺̭̺͈̪͉̬͈͈̘̣̤́̓ͧͣ̿͆ͥ̉ͫ̂̊ͨ͗ͥ̚͘̚̕̚͢ͅd̢̧̨͎̥̪̬͉͓̠̂̽ͯ̃ͮͫͧ͌̽͐̅̌ͥ͒̎̆͘͡͝ ț̴̨̢̛̣͖̣̭̩̥ͭ̊̎͛̓͆ͦ͜͢a̷̷̴̵̢͔͖̠̗̝̻̻̣̹̫̘̫ͫͫͣͭ̓̈́͋̆̏̓́̌̍ͤ̎ͪ͐͐̍̈́ͮ̚͟͟͜͜͠l̜̹͖̠̦͖̠͊̽͆͐͑̍̂̋͋̈́͘͠ē̡̢̛̫͔̥͕̪̝̫͙̩̙͙̝̞̤͙̗͍̋ͫ̆ͦͭ̍̈́̈́͆ͫ͒̀̄͗̔ͥͯ̕͟͝͞͡͠n̴̳̗̰̙̗̄ͭ̂ͪ͝ͅt̴̶̵̷̴̴̨̧͇͙͔̪̫͕͈̬̯͎̞͖̻̟̝̩̎̀̎ͤͥͯ̇ͦ͌͆́ͮ̂̌̋̕͘ͅ ö̴̢̡̢̝̙̜̳͚͕̟̘̪͎̗̩̠̻́̾̿̎͛͌́̃̽͐̓̐ͨ͆̿ͮ̆̚͟͟͠͠͡ͅn̶̢͚̞̟̹͓͋̏̐̉ͬͭ̐̿̀ d͓̲̜̝̜̦̻̳̺̜̓̈̔̏ͦͣ̋̃͐̑̚͘͠͡ͅ_̶̨̛̦̲̻͓̭̟̮̋̀͆ͣͧ̐̚i̵̸̷̬̟̱̞̲ͦͦ͗̐̎ͬ̈́̋̄͌ͣ̚͝ŝ̡͍̤̱̝̤̖̝̖̬͐̓̿ͅp̢̧̨̡̣͉͕̲̻̗͇̰̻̻͖̫̠̬̥̝̃́͛̿̽ͬ́ͬ̈́ͩͥ͂̎̆͛͑ͫͤ̇̐ͧ̓ͮ̕̕͟l̰̳̱͂a̴̷̡̨̘͙̪͔͔̣̭̹̘͖ͦͯ̑͑͂ͅy̠̹ͭͧͦ.̴̡̟̣͇͙̯̬ͥͪ́ͨͩ̋͐ͭ̋̀̇͘̚͡")
                }
                .padding(.horizontal, 30)
                .onAppear {
                    hapticFeedbackManager.playHapticFeedback()
                    withAnimation {
                        showFallingNote = true
                        noteVisible = true
                    }
                }
            }
        }
    }
}

struct PageSixView: View {
    var body: some View {
        ZStack {
            DiaryPageBackground()
            
            VStack {
                TextSection(date: "November 14, 2021", text: "Went hiking in the mountains today. The trail was challenging, but the views from the top were worth it. I felt a great sense of accomplishment reaching the peak and enjoyed the peaceful surroundings. The air was crisp and fresh, and the scenery was breathtaking.")
                TextSection(date: "December 18, 2021", text: "Visited the local art museum today. They have a new exhibit that I've been wanting to see. The artwork was stunning, and I felt inspired to create something of my own. I spent hours wandering through the galleries, absorbing the creativity and talent on display.")
            }
            .padding(.horizontal, 30)
        }
    }
}

